[
    {
        "id": "1",
        "is_active": false,
        "position": "Web Developer",
        "level": "Junior",
        "type": "Full Time",
        "location": "Remote",
        "salary": "52,000",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": ["Proficiency in React, Express, Python (Flask & Django) and other relavant technologies", "Strong understanding of object-oriented programming (OOP) concepts", "Experience working with relational databases like MySQL or PostgreSQL", "Familiarity with revision control systems such as git", "Excellent verbal and written communication skills to effectively collaborate with designers, developers, and stakeholders.", "Ability to work in a fast-paced, agile development environment."],
        "responsibilities": ["Designing and developing efficient, scalable, and user-friendly web applications", "Utilizing your expertise in React, Express, Python Django, and other technologies to handle front-end frameworks, backend servers, and database management", "Troubleshoot and debug issues as they arise", "Stay up-to-date on the latest technologies and best practices in web development","Troubleshoot and debug issues as they arise"],
        "able_to_do": ["Gain hands-on experience developing websites and web applications", "Opportunity to showcase your skills and contribute to exciting projects", "Collaborative and innovative work environment", "You will be supported by mentors and teammates as you work on tasks and projects.", "Contribute ideas and strategies to improve the overall user experience"]
    },
    {
        "id": "2",
        "is_active": false,
        "position": "UI/UX Developer",
        "level": "Staff",
        "type": "Full Time",
        "location": "Remote",
        "salary": "$70,000",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": ["Strong proficiency in HTML5, CSS3, JavaScript, and various front-end frameworks.", "Experience with UI/UX design tools such as Figma, Sketch, or Adobe XD.", "Familiarity with responsive design principles and design systems. With ability to prototype and iterate designs quickly based on user feedback.", "Excellent verbal and written communication skills to effectively collaborate with designers, developers, and stakeholders.", "Ability to work in a fast-paced, agile development environment."],
        "responsibilities": ["Collaborate with product managers and designers to understand user requirements and create user-centered designs.", "Develop wireframes, interactive prototypes, and production-ready UI assets using design tools such as Figma, Sketch, or Adobe XD.", "Build responsive and intuitive user interfaces using HTML, CSS, and JavaScript frameworks such as React, Angular, or Vue.js.", "Ensure cross-browser, cross-platform, and cross-device compatibility, and optimize performance of UI/UX elements.Ensure cross-browser, cross-platform, and cross-device compatibility, and optimize performance of UI/UX elements.", "Collaborate with the development team to create and maintain a design system to ensure consistency across all digital products.", "Collaborate with the development team to create and maintain a design system to ensure consistency across all digital products."],
        "able_to_do": ["design intuitive and user-friendly interfaces for our digital products.", "conduct user research and incorporate feedback to improve the overall user experience.", "stay up-to-date on design trends and best practices to ensure our products are at the forefront of usability and innovation.", " collaborate with cross-functional teams to create visually appealing designs that align with our brand guidelines."]
    },
    {
        "id": "3",
        "is_active": false,
        "position": "Student Recruiter and Onboarding Specialist",
        "level": "Sr.",
        "type": "Full Time",
        "salary": "$50,000",
        "location": "Remote",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": ["Bachelor's degree in Human Resources, Education, or a related field (preferred).", "Proven experience in recruitment, onboarding, or student services in an educational environment.", "Strong interpersonal and communication skills, both written and verbal. Including the ability to engage and connect with a diverse range of students and build meaningful relationships.", "Excellent organizational skills with the ability to multitask and prioritize responsibilities.", "Proficient in using recruitment software, social media platforms, and other technology tools for recruitment purposes.", "Knowledge of educational policies, trends, and regulations."],
        "responsibilities": ["Develop and execute recruitment strategies to attract and enroll prospective students.", "Utilize various channels, including social media, online platforms, and community outreach, to reach out to and engage with prospective students.", "Conduct informational sessions and presentations to showcase the organization's offerings and benefits to potential students.", "Develop and implement an onboarding process to ensure new students have a smooth transition into the organization.", "Coordinate and conduct orientation sessions to familiarize new students with organizational policies, resources, and expectations.", "Serve as a primary point of contact for new students, answering their questions and addressing concerns during the onboarding process.", "Collaborate with various departments to ensure all necessary paperwork, systems access, and resources are provided to incoming students.", "Continuously evaluate and improve the onboarding process based on feedback and benchmarks."],
        "able_to_do": false

    },
    {
        "id": "4",
        "is_active": false,
        "position": "HR Coordinator",
        "level": "Sr.",
        "type": "Full Time",
        "salary": "$55,000",
        "location": "Remote",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": ["Bachelor's degree in Human Resources, Business Administration, or a related field.", "Proven work experience as an HR Coordinator or similar HR role.", "Knowledge of labor laws and regulations in various states and regions.", "Strong interpersonal skills, with the ability to communicate effectively and maintain confidentiality.", "Detail-oriented approach with excellent organizational skills. Including the ability to multitask, prioritize workload, and work under minimal supervision.", "Highly adaptable and flexible in a fast-paced, dynamic work environment."],
        "responsibilities": ["Assist in recruitment processes, including job postings, reviewing resumes, scheduling interviews, conducting background checks, and preparing offer letters.", "Coordinate the onboarding process for new hires, including conducting orientation sessions, collecting required documents, and assisting with the completion of new hire paperwork.", "Maintain accurate and up-to-date employee records, including personnel files, benefits enrollment, time-off requests, and other relevant documentation.", "Assist with payroll administration activities, including timekeeping, leave management, and coordinating with the payroll department to ensure accurate and timely payroll processing", "Coordinate employee benefits programs, including enrollment, changes, and serving as the point of contact for benefit-related queries.", "Assist in maintaining compliance with employment laws and regulations, including monitoring changes in legislation and participating in related training.", "Handle employee inquiries related to HR policies, procedures, and benefits, providing accurate information and timely resolution.", "Maintain professional and collaborative relationships with employees, liaising with various departments to ensure effective communication and employee satisfaction."],
        "able_to_do": false
    },
    {
        "id": "5",
        "is_active": false,
        "position": "Instructor - Web Development",
        "level": "",
        "type": "Full Time",
        "salary": "$65,000",
        "location": "Remote",
        "about": "We are seeking a skilled and passionate Full-Time Instructor to join our dynamic team. The ideal candidate will have expertise in HTML, CSS, JavaScript, React, Express, Pug, Vite, Python, Flask, Django, and proficiency in database technologies including PostgreSQL and MySQL. Strong object-oriented programming (OOP) knowledge is essential.",
        "requirements": ["Proven experience in web devlopement and programming.", "In-depth knowledge of the specified technologies.", "Excellent communication and teaching skills.", "Ability to adapt teaching methods to various learning styles.", "Bachelor's degree in Computer Science or related field is preffered"],
        "responsibilities": ["Deliver engaging and comprehensive lessons in web development technologies", "Provide mentorship and support to students in their learning journey", "Create and update course materials to ensure relevance and effectiveness", "Stay current with industry trends and incorperate them into the curriculum"],
        "able_to_do": false
    },
    {
        "id": "6",
        "is_active": true,
        "position": "Teaching Assistant",
        "level": "",
        "type": "Full Time",
        "salary": "$55,000",
        "location": "Remote",
        "about": "We are hiring a Part-Time Teaching Assistant to support our online programming courses. The ideal candidate will have a strong understanding of HTML, CSS, JavaScript, React, Express, Pug, Vite, Python, Flask, Django, PostgreSQL, MySQL, and object-oriented programming (OOP).",
        "requirements": ["Proficiency in the specified programming languages and technologies.", "Enrolled in or completed a relevant degree program.", "Strong communication and interpersonal skills.", "Passion for helping students succeed in their programming journey."],
        "responsibilities": ["Assist instructors in delivering effective and engaging lessons.", "Provide support and guidance to students during lab sessions and projects.", "", "Evaluate and provide constructive feedback on student assignments.", "Collaborate with the instructional team to enhance the learning experience."],
        "able_to_do": false
    },
    {
        "id": "7",
        "is_active": true,
        "position": "Teaching Assistant",
        "level": "",
        "type": "Part Time",
        "salary": "Pending Experience",
        "location": "Remote",
        "about": "We are hiring a Part-Time Teaching Assistant to support our online programming courses. The ideal candidate will have a strong understanding of HTML, CSS, JavaScript, React, Express, Pug, Vite, Python, Flask, Django, PostgreSQL, MySQL, and object-oriented programming (OOP).",
        "requirements": ["Proficiency in the specified programming languages and technologies.", "Enrolled in or completed a relevant degree program.", "Strong communication and interpersonal skills.", "Passion for helping students succeed in their programming journey.", "This is a part-time role with flexible hours, offering valuable experience in education and programming.", ""],
        "responsibilities": ["Assist instructors in delivering effective and engaging lessons.", "Provide support and guidance to students during lab sessions and projects.", "", "Evaluate and provide constructive feedback on student assignments.", "Collaborate with the instructional team to enhance the learning experience."],
        "able_to_do": false
    },
    {
        "id": "8",
        "is_active": false,
        "position": "",
        "level": "",
        "type": "Full Time",
        "salary": "",
        "location": "Remote",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": [""],
        "responsibilities": [""],
        "able_to_do": [""]
    },
    {
        "id": "9",
        "is_active": false,
        "position": "",
        "level": "",
        "type": "Full Time",
        "salary": "",
        "location": "Remote",
        "about": "We are seeking a skilled and passionate ...",
        "requirements": [""],
        "responsibilities": [""],
        "able_to_do": false
    }
]